## RETO - CAMPAÑA DE MARKETING DE UN BANCO PORTUGUÉS

## EDA y limpieza de los dos sets de datos

- 1 Carga de librerías
- 2 EDA del primer conjunto de datos ('bank-additional.csv')
- 3 EDA del segundo conjunto de datos ('customer-details.xlsx')
- 4 Unión de los dos datasets
- 5 Limpieza de los datasets

## 1 Carga de librerías

In [1]:
import pandas as pd
import numpy as np
from datetime import datetime
pd.set_option('display.max_columns', None)

## 2 EDA del primer conjunto de datos ('bank-additional.csv')

In [2]:
bank = pd.read_csv('DataSource/bank-additional.csv',index_col = 0)
print(f"El número de filas que tenemos es {bank.shape[0]}, y el número de columnas es {bank.shape[1]}")

El número de filas que tenemos es 43000, y el número de columnas es 23

In [3]:
bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp.var.rate', 'cons.price.idx', 'cons.conf.idx', 'euribor3m',
       'nr.employed', 'y', 'date', 'latitude', 'longitude', 'id_'],
      dtype='object')

In [4]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
Index: 43000 entries, 0 to 27570
Data columns (total 23 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             37880 non-null  float64
 1   job             42655 non-null  object
 2   marital         42915 non-null  object
 3   education       41193 non-null  object
 4   default         34019 non-null  float64
 5   housing         41974 non-null  float64
 6   loan            41974 non-null  float64
 7   contact         43000 non-null  object
 8   duration        43000 non-null  int64
 9   campaign        43000 non-null  int64
 10  pdays           43000 non-null  int64
 11  previous        43000 non-null  int64
 12  poutcome        43000 non-null  object
 13  emp.var.rate    43000 non-null  float64
 14  cons.price.idx  42529 non-null  object
 15  cons.conf.idx   43000 non-null  object
 16  euribor3m       33744 non-null  object
 17  nr.employed     43000 non-null  object
 18  y               43000 non-null  object
 19  date            42752 non-null  object
 20  latitude        43000 non-null  float64
 21  longitude       43000 non-null  float64
 22  id_             43000 non-null  object
dtypes: float64(7), int64(4), object(12)
memory usage: 7.9+ MB

## Conclusiones que sacamos con el .info()

a) Columnas con incluyen nulos:
- age
- job
- marital
- education
- default
- housing
- loan
- cons.price.idx
- euribor3m
- date

b) Columnas con dtype que no son coherentes:
- cons.price.idx
- cons.conf.idx
- euribor3m
- nr.employed
- date

In [5]:
# Valores únicos y conteo de éstos de todas las columnas categóricas.
bank_cat = bank.select_dtypes(include = 'O')
lista_col = bank_cat.columns.tolist()
for col in lista_col:
    print(f'Para la columna {col.upper()}:\n')# Printeamos el nombre de la columna en mayúsculas.
    print(f'Los valóres únicos son: {bank[col].unique()}\n')# Mostramos los valores únicos de la columna
    print(f'El conteo de valores únicos es:\n{bank[col].value_counts()}') # Observamos el conteo de cada valor único
    print('-----------')

Para la columna JOB:

Los valóres únicos son: ['housemaid' 'services' 'admin.' 'blue-collar' 'technician' 'retired'
 'management' 'unemployed' 'self-employed' nan 'entrepreneur' 'student']

El conteo de valores únicos es:
job
admin.           10873
blue-collar       9654
technician        7026
services          4162
management        3050
retired           1790
entrepreneur      1522
self-employed     1489
housemaid         1123
unemployed        1063
student            903
Name: count, dtype: int64
-----------
Para la columna MARITAL:

Los valóres únicos son: ['MARRIED' 'SINGLE' 'DIVORCED' nan]

El conteo de valores únicos es:
marital
MARRIED     25999
SINGLE      12105
DIVORCED     4811
Name: count, dtype: int64
-----------
Para la columna EDUCATION:

Los valóres únicos son: ['basic.4y' 'high.school' 'basic.6y' 'basic.9y' 'professional.course' nan
 'university.degree' 'illiterate']

El conteo de valores únicos es:
education
university.degree      12722
high.school             9925
basic.9y                6309
professional.course     5477
basic.4y                4356
basic.6y                2386
illiterate                18
Name: count, dtype: int64
-----------
Para la columna CONTACT:

Los valóres únicos son: ['telephone' 'cellular']

El conteo de valores únicos es:
contact
cellular     27396
telephone    15604
Name: count, dtype: int64
-----------
Para la columna POUTCOME:

Los valóres únicos son: ['NONEXISTENT' 'FAILURE' 'SUCCESS']

El conteo de valores únicos es:
poutcome
NONEXISTENT    37103
FAILURE         4461
SUCCESS         1436
Name: count, dtype: int64
-----------
Para la columna CONS.PRICE.IDX:

Los valóres únicos son: ['93,994' nan '94,465' '93,918' '93,444' '93,798' '93,2' '92,756' '92,843'
 '93,075' '92,893' '92,963' '92,469' '92,201' '92,379' '92,431' '92,649'
 '92,713' '93,369' '93,749' '93,876' '94,055' '94,215' '94,027' '94,199'
 '94,601' '94,767']

El conteo de valores únicos es:
cons.price.idx
93,994    7938
93,918    6937
92,893    5985
93,444    5349
94,465    4522
93,2      3731
93,075    2552
92,201     803
92,963     742
92,431     471
92,649     375
94,215     320
94,199     316
92,843     298
92,379     274
93,369     271
94,027     242
94,055     236
93,876     224
94,601     212
92,469     184
92,713     179
93,749     179
94,767     130
93,798      48
92,756      11
Name: count, dtype: int64
-----------
Para la columna CONS.CONF.IDX:

Los valóres únicos son: ['-36,4' '-41,8' '-42,7' '-36,1' '-40,4' '-42' '-45,9' '-50' '-47,1'
 '-46,2' '-40,8' '-33,6' '-31,4' '-29,8' '-26,9' '-30,1' '-33' '-34,8'
 '-34,6' '-40' '-39,8' '-40,3' '-38,3' '-37,5' '-49,5' '-50,8']

El conteo de valores únicos es:
cons.conf.idx
-36,4    8020
-42,7    7004
-46,2    6057
-36,1    5408
-41,8    4568
-42      3782
-47,1    2581
-31,4     815
-40,8     748
-26,9     477
-30,1     379
-40,3     328
-37,5     318
-50       299
-29,8     277
-34,8     275
-38,3     245
-39,8     239
-40       225
-49,5     214
-33,6     185
-34,6     183
-33       181
-50,8     133
-40,4      48
-45,9      11
Name: count, dtype: int64
-----------
Para la columna EURIBOR3M:

Los valóres únicos son: ['4,857' nan '4,856' '4,855' '4,859' '4,86' '4,858' '4,864' '4,865'
 '4,866' '4,967' '4,961' '4,959' '4,958' '4,96' '4,962' '4,955' '4,947'
 '4,956' '4,966' '4,963' '4,957' '4,968' '4,97' '4,965' '4,964' '5,045'
 '4,936' '4,921' '4,918' '4,912' '4,827' '4,794' '4,76' '4,733' '4,7'
 '4,663' '4,592' '4,474' '4,406' '4,343' '4,286' '4,245' '4,223' '4,191'
 '4,153' '4,12' '4,076' '4,021' '3,901' '3,879' '3,853' '3,743' '3,563'
 '3,488' '3,428' '3,329' '3,282' '3,053' '1,811' '1,799' '1,778' '1,757'
 '1,726' '1,703' '1,687' '1,663' '1,65' '1,64' '1,629' '1,614' '1,602'
 '1,584' '1,56' '1,556' '1,548' '1,538' '1,531' '1,52' '1,51' '1,498'
 '1,483' '1,479' '1,466' '1,453' '1,445' '1,435' '1,423' '1,415' '1,41'
 '1,405' '1,406' '1,4' '1,392' '1,384' '1,372' '1,365' '1,354' '1,344'
 '1,334' '1,327' '1,313' '1,299' '1,291' '1,281' '1,266' '1,25' '1,244'
 '1,259' '1,264' '1,27' '1,262' '1,26' '1,268' '1,286' '1,252' '1,235'
 '1,224' '1,215' '1,206' '1,099' '1,085' '1,072' '1,059' '1,048' '1,044'
 '1,029' '1,018' '0,996' '0,979' '0,969' '0,944' '0,937' '0,933' '0,921'
 '0,914' '0,908' '0,884' '0,883' '0,881' '0,879' '0,873' '0,869' '0,861'
 '0,859' '0,854' '0,851' '0,849' '0,843' '0,838' '0,834' '0,829' '0,825'
 '0,821' '0,819' '0,813' '0,809' '0,803' '0,797' '0,788' '0,781' '0,778'
 '0,773' '0,771' '0,77' '0,768' '0,766' '0,762' '0,755' '0,749' '0,743'
 '0,741' '0,739' '0,75' '0,753' '0,754' '0,752' '0,744' '0,74' '0,742'
 '0,737' '0,735' '0,733' '0,73' '0,731' '0,728' '0,724' '0,722' '0,72'
 '0,719' '0,716' '0,715' '0,714' '0,718' '0,721' '0,717' '0,712' '0,71'
 '0,709' '0,708' '0,706' '0,707' '0,7' '0,655' '0,654' '0,653' '0,652'
 '0,651' '0,65' '0,649' '0,646' '0,644' '0,643' '0,639' '0,637' '0,635'
 '0,636' '0,634' '0,638' '0,64' '0,642' '0,645' '0,659' '0,663' '0,668'
 '0,672' '0,677' '0,682' '0,683' '0,684' '0,685' '0,688' '0,69' '0,692'
 '0,695' '0,697' '0,699' '0,701' '0,702' '0,704' '0,711' '0,713' '0,723'
 '0,727' '0,729' '0,732' '0,748' '0,761' '0,767' '0,782' '0,79' '0,793'
 '0,802' '0,81' '0,822' '0,827' '0,835' '0,84' '0,846' '0,87' '0,876'
 '0,885' '0,889' '0,893' '0,896' '0,899' '0,898' '0,9' '0,904' '0,905'
 '0,903' '0,895' '0,894' '0,891' '0,89' '0,888' '0,886' '0,882' '0,88'
 '0,878' '0,877' '0,942' '0,953' '0,956' '0,959' '0,965' '0,972' '0,977'
 '0,982' '0,985' '0,987' '0,993' '1' '1,008' '1,016' '1,025' '1,032'
 '1,037' '1,043' '1,047' '1,05' '1,049' '1,046' '1,041' '1,04' '1,039'
 '1,035' '1,03' '1,031' '1,028']

El conteo de valores únicos es:
euribor3m
4,857    2287
4,962    2124
4,963    2019
4,961    1594
4,964     964
         ...
3,743       1
3,563       1
3,488       1
3,428       1
0,969       1
Name: count, Length: 309, dtype: int64
-----------
Para la columna NR.EMPLOYED:

Los valóres únicos son: ['5191' '5228,1' '5195,8' '5176,3' '5099,1' '5076,2' '5017,5' '5023,5'
 '5008,7' '4991,6' '4963,6']

El conteo de valores únicos es:
nr.employed
5228,1    16980
5099,1     8937
5191       8020
5195,8     3830
5076,2     1748
5017,5     1133
4991,6      812
5008,7      683
4963,6      665
5023,5      181
5176,3       11
Name: count, dtype: int64
-----------
Para la columna Y:

Los valóres únicos son: ['no' 'yes']

El conteo de valores únicos es:
y
no     38156
yes     4844
Name: count, dtype: int64
-----------
Para la columna DATE:

Los valóres únicos son: ['2-agosto-2019' '14-septiembre-2016' '15-febrero-2019' ... '28-mayo-2016'
 '22-abril-2015' '7-marzo-2015']

El conteo de valores únicos es:
date
28-febrero-2018      95
28-febrero-2016      94
28-febrero-2015      92
28-febrero-2017      89
28-febrero-2019      85
                     ..
2-julio-2016         11
14-abril-2015        10
20-noviembre-2015    10
4-abril-2017         10
21-diciembre-2019    10
Name: count, Length: 1825, dtype: int64
-----------
Para la columna ID_:

Los valóres únicos son: ['089b39d8-e4d0-461b-87d4-814d71e0e079'
 'e9d37224-cb6f-4942-98d7-46672963d097'
 '3f9f49b5-e410-4948-bf6e-f9244f04918b' ...
 'cadadd4b-7ee5-4019-b13a-ca01bb67ca5b'
 '5f432048-d515-4bb5-9c94-62db451f88d4'
 '993bbbd6-4dbc-4a40-a408-f91f8462bee6']

El conteo de valores únicos es:
id_
089b39d8-e4d0-461b-87d4-814d71e0e079    1
c25b5d31-bb7e-41af-898d-42bf3e479351    1
bfd6bad9-f23a-445a-838e-10ee90110534    1
075b0e72-b5e3-43f4-90cd-29f9090b2b1a    1
482a2d86-c9f0-46b7-9f6f-82c769690d48    1
                                       ..
27e317a2-722c-454d-850b-97b536029c81    1
6d9c117f-af67-4a89-83db-caf514a42374    1
6a229b87-6bf9-4339-9639-b98555df71e7    1
cc891cf7-206c-47f0-804f-20b5b757d5fc    1
993bbbd6-4dbc-4a40-a408-f91f8462bee6    1
Name: count, Length: 43000, dtype: int64
-----------

# Conclusiones de los valores únicos

- **job**: El resultado principal es 'admin', pero no con una diferencia significativa del siguiente. Hay nulos
- **marital**: Sólo tenemos 4 valores (MARRIED, SINGLE, DIVORCED y nan), el primero de ellos destaca muy por encima del resto. Hay nulos
- **education**: El resultado principal es 'university degree', es destacable que 'illiterate' solo posee 18 registros. Hay nulos
- **default**: Sólo tenemos dos valores (No y Si), el segundo sólo aparece en 3 registros.
- **housing**: Tres valores (No, Sí y Unknown).
- **loan**: Dos valores únicos (No y Sí), el primero notablemente más presente que el segundo.
- **contact**: Dos valores (telephone y cellular). El segundo tiene casi el doble de registros que el primero.
- **poutcome**: Tres valores (NONEXISTENT, FAILURE, SUCCESS). Tenemos notablemente más datos del primero que del resto.
- **cons.price.idx**: Tiene nulos. Es una falsa columna categórica.
- **cons.conf.idx**: Es una falsa columna categórica.
- **euribor3m**: Tiene nulos. Es una falsa columna categórica.
- **nr.employed**: Tiene nulos. Es una falsa columna categórica.
- **y**: Dos valores (no, yes). Gran cantidad de noes frente a síes.
- **date**: Falsa columna categórica.
- **id_**: Cada valor sólo aparece una vez, es decir, no tenemos dos registros con el mismo identificador.

In [6]:
# Calcula el número de nulos (solo de las columnnas que tengan al menos uno)
bank_nulos = bank.isnull().sum()
df_nulos = pd.DataFrame(bank_nulos, columns = ["total_nulos"])
df_nulos = df_nulos[df_nulos["total_nulos"] > 0]
df_nulos

                total_nulos
age                    5120
job                     345
marital                  85
education              1807
default                8981
housing                1026
loan                   1026
cons.price.idx          471
euribor3m              9256
date                    248

## 3 EDA del segundo conjunto de datos ('customer-details.xlsx')
- Concatena las tres hojas del conjunto de datos
- Carga del archivo, mirar dimensiones, columnas, datos estadísticos, nulos y duplicados

In [7]:
# Crearemos ahora 3 DF distintos, uno para cada año (y hoja) de los datos de los clientes.
customer_2012 = pd.read_excel("DataSource/customer-details.xlsx", sheet_name="2012", index_col = 0)
customer_2013 = pd.read_excel("DataSource/customer-details.xlsx", sheet_name="2013", index_col = 0)
customer_2014 = pd.read_excel("DataSource/customer-details.xlsx", sheet_name="2014", index_col = 0)

customer_concat = pd.concat([customer_2012, customer_2013, customer_2014], axis = 0, ignore_index = True)
customer_concat.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [8]:
print(f"El número de filas que tenemos en customer_concat es {customer_concat.shape[0]}, y el número de columnas es {customer_concat.shape[1]}")

El número de filas que tenemos en customer_concat es 43170, y el número de columnas es 6

In [9]:
customer_concat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43170 entries, 0 to 43169
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Income             43170 non-null  int64
 1   Kidhome            43170 non-null  int64
 2   Teenhome           43170 non-null  int64
 3   Dt_Customer        43170 non-null  datetime64[ns]
 4   NumWebVisitsMonth  43170 non-null  int64
 5   ID                 43170 non-null  object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 2.0+ MB

In [10]:
customer_concat.isnull().sum()

Income               0
Kidhome              0
Teenhome             0
Dt_Customer          0
NumWebVisitsMonth    0
ID                   0
dtype: int64

In [11]:
customer_concat.duplicated().sum()

0

In [12]:
# Vamos ahora a comparar las dimensiones del DataFrame de bank con el de customer_concat
print(f"El número de filas que tenemos en bank es {bank.shape[0]}, y el número de columnas es {bank.shape[1]}")
print(f"El número de filas que tenemos en customer_concat es {customer_concat.shape[0]}, y el número de columnas es {customer_concat.shape[1]}")

El número de filas que tenemos en bank es 43000, y el número de columnas es 23
El número de filas que tenemos en customer_concat es 43170, y el número de columnas es 6

# Conclusiones previas a unir los dos datasets
- Aquí podemos ver que el número de filas de uno y otro es distinto. ¿A qué puede ser debido?
- Recordemos que el primero son datos de clientes a lo que se ha contactado para la campaña, mientras que el segundo son datos de clientes del banco.
- En este caso es más conveniente unir los DF con un merge del tipo 'inner' ya que nos interesan los valores coincidentes de ambos DF. ¿Por qué columna unimos?
- Uniremos por la columna que nos da el número identificativo del cliente, es decir, 'id_' del DF bank e 'ID' del DF customer_concat

## 4 Unión de datos
- Hacer uso de merge para la unión de los dos conjuntos de datos

In [13]:
bank = bank.merge(customer_concat,how = 'inner', left_on = 'id_', right_on = "ID")
bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

## 5 Limpieza de los datos.
- Elimina las columnas redundantes (drop)
- Homogeneiza los nombres de las columnas (replace)
- Haz que todos los datos estén en minúsculas. Para ello utiliza .str.lower()
- Crea nuevas columnas para el mes('contact_month') y el año('contact_year') de la columna 'date' (split)
- Convierte la columna 'date' a tipo datetime con todatetime para cambiar el tipo de dato de la columna (Recuerda usar el formato %d-%m-%Y)
- Reemplaza los . por espacios en la columna 'education'. Utiliza.str.replace()
- Convierte a float las columnas que deberían serlo (apply con función lambda)
- Mapear los valores 0 y 1 por No y Sí.
- Genera nulos en la columna 'pdays'

In [14]:
# 5.1 Elimina columnas redundantes
bank.drop("id_", axis = 1, inplace = True)

In [15]:
# 5.2 Homogeneiza los nombres de las columnas: mayusculas con minúsculas, sin espacios y cambiar '.' por '_'
nuevas_columnas = {columna: columna.lower().replace(".", "_") for columna in bank.columns}
bank.rename(columns = nuevas_columnas, inplace = True)
bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp_var_rate', 'cons_price_idx', 'cons_conf_idx', 'euribor3m',
       'nr_employed', 'y', 'date', 'latitude', 'longitude', 'income',
       'kidhome', 'teenhome', 'dt_customer', 'numwebvisitsmonth', 'id'],
      dtype='object')

In [16]:
# 5.3 Haz que todos los datos estén en minúsculas. Para ello utiliza .str.lower()
for col in bank.columns.to_list():
    try:
        bank[col] = bank[col].str.lower()
    except:
        pass
bank.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id
0,NaN,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097

In [17]:
# 5.4 Crea nuevas columnas para el mes('contact_month') y el año('contact_year') de la columna 'date'. 
fecha = bank['date'].str.split('-', expand = True)
bank['contact_month'] = fecha[1]
bank['contact_year'] = fecha[2]
bank.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,contact_month,contact_year
0,NaN,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,agosto,2019
1,57.0,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,septiembre,2016

In [18]:
# 5.5 Convierte la columna 'date' a tipo datetime.
meses = {'enero':'01',
       'febrero':'02',
       'marzo':'03',
       'abril':'04',
       'mayo':'05',
       'junio':'06',
       'julio':'07',
       'agosto':'08',
       'septiembre':'09',
       'octubre':'10',
       'noviembre':'11',
       'diciembre':'12'}

bank.replace({'date':meses}, regex = True,inplace = True)
bank['date'] = pd.to_datetime(bank['date'], format = "%d-%m-%Y") 
bank.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,contact_month,contact_year
0,NaN,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,"93,994","-36,4","4,857",5191,no,2019-08-02,41.495,-71.233,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,agosto,2019
1,57.0,services,married,high.school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,"93,994","-36,4",NaN,5191,no,2016-09-14,34.601,-83.923,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,septiembre,2016

In [19]:
bank['date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 43000 entries, 0 to 42999
Series name: date
Non-Null Count  Dtype
--------------  -----
42752 non-null  datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 336.1 KB

In [20]:
# 5.6 Reemplaza los . por espacios en la columna 'education'. Utiliza.str.replace()
bank['education'] = bank['education'].str.replace('.',' ')
bank.sample()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,contact_month,contact_year
31548,45.0,management,married,university degree,0.0,1.0,0.0,cellular,239,1,999,0,nonexistent,-1.8,"92,893","-46,2","1,327","5099,1",no,2017-10-28,35.709,-112.722,162315,0,2,2014-11-19,19,8b943ef8-b205-477b-83e8-2aa28adc842d,octubre,2017

In [21]:
# 5.7 Convierte a float las columnas que deberían serlo
str_float = ['cons_price_idx','cons_conf_idx','euribor3m','nr_employed']
for col in str_float:
    bank[col] = bank[col].str.replace(',','.')
    bank[col] = bank[col].apply(lambda x: float(x))
bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,contact_month,contact_year
0,NaN,housemaid,married,basic 4y,0.0,0.0,0.0,telephone,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,2019-08-02,41.495,-71.233,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,agosto,2019
1,57.0,services,married,high school,NaN,0.0,0.0,telephone,149,1,999,0,nonexistent,1.1,93.994,-36.4,NaN,5191.0,no,2016-09-14,34.601,-83.923,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,septiembre,2016
2,37.0,services,married,high school,0.0,1.0,0.0,telephone,226,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,2019-02-15,34.939,-94.847,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,febrero,2019
3,40.0,admin.,married,basic 6y,0.0,0.0,0.0,telephone,151,1,999,0,nonexistent,1.1,93.994,-36.4,NaN,5191.0,no,2015-11-29,49.041,-70.308,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,noviembre,2015
4,56.0,services,married,high school,0.0,0.0,1.0,telephone,307,1,999,0,nonexistent,1.1,93.994,-36.4,NaN,5191.0,no,2017-01-29,38.033,-104.463,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,enero,2017

In [22]:
# 5.8 Mapear los valores 0 y 1 por No y Sí.
diccionario_mapeo = {0: "No", 1: "Si"}
mapear = ['default','housing','loan']
for col in mapear:
    bank[col] = bank[col].map(diccionario_mapeo)

bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,contact_month,contact_year
0,NaN,housemaid,married,basic 4y,No,No,No,telephone,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,2019-08-02,41.495,-71.233,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,agosto,2019
1,57.0,services,married,high school,NaN,No,No,telephone,149,1,999,0,nonexistent,1.1,93.994,-36.4,NaN,5191.0,no,2016-09-14,34.601,-83.923,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,septiembre,2016
2,37.0,services,married,high school,No,Si,No,telephone,226,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,2019-02-15,34.939,-94.847,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,febrero,2019
3,40.0,admin.,married,basic 6y,No,No,No,telephone,151,1,999,0,nonexistent,1.1,93.994,-36.4,NaN,5191.0,no,2015-11-29,49.041,-70.308,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e,noviembre,2015
4,56.0,services,married,high school,No,No,Si,telephone,307,1,999,0,nonexistent,1.1,93.994,-36.4,NaN,5191.0,no,2017-01-29,38.033,-104.463,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb,enero,2017

# 5.9 Genera nulos en la columna 'pdays'.
No tiene mucho sentido que hayan pasado 999 días desde el último contacto, probablemente es la forma de indicar que no tienen ese valor, es decir, es un valor nulo. 
Por lo tanto vamos a sustituirlo por nulos de numpy (np.nan)

In [23]:
bank["pdays"] = bank["pdays"].replace(999, np.nan)
bank.head(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id,contact_month,contact_year
0,NaN,housemaid,married,basic 4y,No,No,No,telephone,261,1,NaN,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,2019-08-02,41.495,-71.233,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079,agosto,2019
1,57.0,services,married,high school,NaN,No,No,telephone,149,1,NaN,0,nonexistent,1.1,93.994,-36.4,NaN,5191.0,no,2016-09-14,34.601,-83.923,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097,septiembre,2016
2,37.0,services,married,high school,No,Si,No,telephone,226,1,NaN,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,2019-02-15,34.939,-94.847,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b,febrero,2019

In [24]:
# Guardar los datos limpios como archivo csv 'bank-limpio.csv'
bank.to_csv('DataSource/bank-limpio.csv')